#Этап 1:
# 1. Выбрал структуру для хранения данных для поля "крестиков-ноликов" (словарь).
# 2. Наполненил ее случайным состоянием для каждой ячейки: крестик, нолик, пусто
#    Вызов функции structure()
# 3. Рисование поля клеток с отображением текущего состояния (frontend в консоли):
#    Вызов функции rendering(dictinary: dict). Используем библиотеку Texttable
# 4. Создаем frontend модуль: все, что связано с прорисовкой поля и импортируем в основную программу:
#    Импортирем Module_Frontend и запускаем

import Module_Frontend as F

F